package com.example.androidlab1

import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle

class MainActivity : AppCompatActivity() {

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_main)
    }
//TODO ЛР 1
//Разработать мобильное приложение согласно прототипа, представленного ниже на рисунке 1. Реализовать следующий функционал:
//Задание на 4-6 баллов
//1.	По нажатию на кнопку «FEED» происходит обновление счетчика в поле Satiety, каждые 15 нажатий, реализовать анимацию кота( по своему усмотрению)
//2.	Предусмотреть согласно Guidelines платформы возможность поделиться результатом в соц сетях
//3.	Реализовать пункт О Разработчике, где указать номер группы, фамилию и номер лабораторной
//4.	Вести запись результатов и отобразить в виде таблице (Дата и результат)
//Задание на 6-8 баллов
//1.	Реализовать механизм запоминания пользователей (может играть несколько человек на 1 устройстве)
//2.	Окно загрузки с анимированным обьектом
//3.x	Авторизация через Google-play/ GameCenter (в зависимости от платформы)
//4.x	Механизм  в стиле GuitarHero, по нажатию на совпадение, происходит обновление счетчика
//
// Задание на 8-10 баллов
//1.x	На главном экране устройства, реализовать виджет с отображением результатов последней игры
//2. 	Реализовать механизм добавления достижений в игре
//3.	Окно помощи пользователю с предоставлением информации о возможностях и правилах в виде ленты (см. Рисунок 2)
//4.	Реализовать максимальное соблюдение GuideLines плафтормы и аргументировать свой выбор


}